Documents/СоглашениеОРасторженииДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>СоглашениеОРасторженииДоговора</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказДоговор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДолгиПоРассрочкам</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПокупателей</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентами</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыРозницыВПроизводстве</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиВВалюте</xr:Item>
				<xr:Item>AccumulationRegister.Продажи</xr:Item>
				<xr:Item>AccumulationRegister.ПродажиПоЗаказДоговорам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСКонтрагентамиПоЗаказам</xr:Item>
				<xr:Item>AccumulationRegister.КонверсияВходящихКонтактов</xr:Item>
				<xr:Item>AccumulationRegister.ДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаказДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаРасторженияДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладСписанияМатериалов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладСписанияТоваров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДоходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяРасходов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДополнительныхЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииПодразделений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТоварыУслуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Бесплатно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗагруженоИзПостроителя</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комната</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерПотолка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПоПрайсу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦветФактуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЦветФактуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПоПрайсу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДоходов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДоходовИРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Комната</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЗаказам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказДоговор</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентами</Name>
			<Comment>Взаиморасчеты с контрагентами</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УДАЛИТЬ_Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПродукции</v8:Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеСРасчетногоСчета</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОплатаБанковскойКартой</v8:Type>
						<v8:Type>cfg:DocumentRef.Замена</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТовараОтПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ВзаиморасчетыСКонтрагентамиВВалюте.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ВзаиморасчетыСКонтрагентамиВВалюте</Name>
			<Comment>Взаиморасчеты с контрагентами в валюте</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/СоглашениеОРасторженииДоговора/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоНовый() Тогда
		ИнициализироватьСлужебныеРеквизиты();
		Автор = Пользователи.ТекущийПользователь();		
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказДоговор") Тогда		
		ЗаказДоговор = ДанныеЗаполнения;
		Организация  = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		ЗаполнитьТоварыПоДоговору();
		ЗаполнитьМатериалыПоДоговору();
		
	КонецЕсли;
	
	СтатьяДоходов  = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, "Доход");
	СтатьяРасходов = ФинансыСервер.ПолучитьСтатьюДоходовРасходов(ЭтотОбъект, "Расход", Ложь);

	Если ЭтоНовый() Тогда
		ДозаполнитьПоУмолчанию();
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИнициализироватьСлужебныеРеквизиты(); 
	
	ДозаполнитьПоУмолчанию();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ТоварыУслуги.Количество() = 0 И НЕ ПроверяемыеРеквизиты.Найти("СкладСписанияТоваров") = Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СкладСписанияТоваров"));
	КонецЕсли;
	
	Если Материалы.Количество() = 0 И НЕ ПроверяемыеРеквизиты.Найти("СкладСписанияМатериалов") = Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СкладСписанияМатериалов"));
	КонецЕсли;
	
	Если СуммаДокумента = 0 И НЕ ПроверяемыеРеквизиты.Найти("СтатьяДоходов") = Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("СтатьяДоходов"));
	КонецЕсли;
	
	// #13826 
	Для Индекс = 0 по Материалы.Количество()-1 Цикл
		СтрокаТабличнойЧасти = Материалы[Индекс];
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУслуга(СтрокаТабличнойЧасти.Номенклатура) Тогда
			ТекстОшибки = "В строке " + Строка(Индекс+1) + " таблицы ""Материалы"" выбрана номенклатура-услуга";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Материалы["+Формат(Индекс, "ЧГ=0")+"].Номенклатура", , Отказ);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	СуммаДокумента = ТоварыУслуги.Итог("Сумма");
					
	// Необходимо проверить, что ещё нет документа расторжения
	УстановитьПривилегированныйРежим(Истина);
	Запрос = новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СоглашениеОРасторженииДоговора.Ссылка
	|ИЗ
	|	Документ.СоглашениеОРасторженииДоговора КАК СоглашениеОРасторженииДоговора
	|ГДЕ
	|	СоглашениеОРасторженииДоговора.ЗаказДоговор = &ЗаказДоговор
	|	И НЕ СоглашениеОРасторженииДоговора.Ссылка = &ТекущийДокумент";
	Запрос.УстановитьПараметр("ЗаказДоговор", ЗаказДоговор);
	Запрос.УстановитьПараметр("ТекущийДокумент", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Сообщить("По указанному договору уже имеется документ " + Выборка.Ссылка);
		Отказ = Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	//#6303
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда 	
		ЕстьМонтажВРаботеИлиВыполнен = Документы.ЗаказДоговор.ЕстьПроведенныйМонтажВРаботеИлиВыполнен(ЗаказДоговор);
		Если НЕ ПометкаУдаления И ЕстьМонтажВРаботеИлиВыполнен Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
         			"По заказ-договору " + ЗаказДоговор + " имеются монтажи в работе или выполненные монтажи. Проведение соглашения о расторжении невозможно!", , , , Отказ);	
		КонецЕсли;
	КонецЕсли;	

	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПередЗаписью(ЭтотОбъект, РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//// №6828 необходимо ЗД перевести в статус Отменен
	// #12975 закомментировано, будет выполняться через Оповестить
	//Если НЕ ЗаказДоговор.ТекущийСтатус = Справочники.СтатусыЗаказДоговоров.Отменен Тогда
	//	
	//	//++ №12975 комментируем, т.к. нужно сразу получить объект и отредактировать
	//	//// Попробуем заблокировать объект
	//	//ПроверкаОбъектЗаблокирован = ОбщийМодульВызовСервера.ПроверкаОбъектЗаблокирован(ЗаказДоговор);
	//	//Если НЕ ПроверкаОбъектЗаблокирован.Заблокирован Тогда
	//	// меняем незаблокированный ЗД
	//	//-- №12975
	//	
	//		Попытка
	//			ДокументОбъект = ЗаказДоговор.ПолучитьОбъект();
	//			ДокументОбъект.ТекущийСтатус = Справочники.СтатусыЗаказДоговоров.Отменен;
	//			ДокументОбъект.Записать(?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	//		Исключение
	//			Сообщить("Не удалось перевести договор в статус ""Отменен""." + Символы.ПС + ОписаниеОшибки());
	//			Отказ = Истина;
	//			Возврат;
	//		КонецПопытки;
	//	//Иначе
	//	//	// уведомляем пользователя, что ЗД заблокирован
	//	//	ТекстСообщения = Строка(ЗаказДоговор) + " не удается перевести в статус ""Расторгнут"", 
	//	//		|т.к. объект заблокирован " + ?(ПроверкаОбъектЗаблокирован.ЗаблокированВТекущемСеансе, "текущим пользователем", "пользователем " + ПроверкаОбъектЗаблокирован.ПользовательИДата) + ".
	//	//		|Проведение документа " + Ссылка + " отменено.";
	//	//	Сообщить(ТекстСообщения);
	//	//	Отказ = Истина;
	//	//	Возврат;
	//	//КонецЕсли;
	//
	//КонецЕсли;
	
	// Сделаем обратные движения ЗД
	//#14559 Расторгнутый ЗД не делает движение, поэтому пока убираем этот код, так как СОРД при первом провдении делает "лишние" движения
	//ОбъектДоговор = ЗаказДоговор.ПолучитьОбъект();
	//Для Каждого РегистрДвижения Из ОбъектДоговор.Движения Цикл		
	//	РегистрДвижения.Прочитать();
	//	Если РегистрДвижения.Количество() = 0 Тогда
	//		Продолжить;
	//	КонецЕсли;
	//	
	//	Движения[РегистрДвижения.Метаданные().Имя].Записывать = Истина;
	//	Для Каждого ТекущаяСтрока Из РегистрДвижения Цикл
	//		Движение = Движения[РегистрДвижения.Метаданные().Имя].Добавить();
	//		ЗаполнитьЗначенияСвойств(Движение, ТекущаяСтрока);
	//		
	//		// Для остаточных регистров нужно заменить вид движения
	//		Если РегистрДвижения.Метаданные().ВидРегистра = Метаданные.СвойстваОбъектов.ВидРегистраНакопления.Остатки Тогда
	//			Движение.ВидДвижения = ?(Движение.ВидДвижения = ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
	//		Иначе
	//		// а для оборотных добавить минус	
	//			Для Каждого ТекущийРесурс Из РегистрДвижения.Метаданные().Ресурсы Цикл
	//				Если Строка(ТекущийРесурс.Тип) = "Число" Тогда
	//					Движение[ТекущийРесурс.Имя] = -Движение[ТекущийРесурс.Имя];
	//				КонецЕсли;
	//			КонецЦикла;
	//		КонецЕсли;	
	//	КонецЦикла;		
	//КонецЦикла;	
	
	Если СуммаДокумента > 0 Тогда
		
		ПериодЗД = ЗаказДоговор.Дата;
		
		// РасчетыПоЗаказам
		Движения.РасчетыПоЗаказам.Записывать = Истина;
		Движение = Движения.РасчетыПоЗаказам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Заказ = ЗаказДоговор;
		Движение.Сумма = СуммаДокумента;
		Движение.Контрагент = ЗаказДоговор.Контрагент; // №6496 добавлен контрагент в измерение
		
		// регистр ВзаиморасчетыСКонтрагентами Приход
		Движения.ВзаиморасчетыСКонтрагентами.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентами.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = ЗаказДоговор.Организация;
		Движение.Контрагент = ЗаказДоговор.Контрагент;
		Движение.Договор = ЗаказДоговор.ДоговорКонтрагента;
		//Движение.Документ = ЗаказДоговор;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(ЗаказДоговор, СуммаДокумента);
		
		//Взаиморасчеты с контрагентами в валюте
		Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Записывать = Истина;
		Движение = Движения.ВзаиморасчетыСКонтрагентамиВВалюте.Добавить();
		Движение.ВидДвижения =ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Организация = ЗаказДоговор.Организация;
		Движение.Контрагент = ЗаказДоговор.Контрагент;
		Движение.Договор = ЗаказДоговор.ДоговорКонтрагента;
		Движение.Валюта = ЗаказДоговор.Валюта;
		Движение.Сумма = СуммаДокумента;
		
		// регистр ВзаиморасчетыСКонтрагентамиПоЗаказам Приход
		Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Записывать = Истина;				
		Движение = Движения.ВзаиморасчетыСКонтрагентамиПоЗаказам.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Заказ = ЗаказДоговор;
		Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(ЗаказДоговор, СуммаДокумента);
		
		//регистр ПродажиПоЗаказДоговорам
		МенеджерПродажи = Справочники.Пользователи.ПустаяСсылка();
		Если НЕ ЗаказДоговор.Основание = Неопределено И НЕ ЗаказДоговор.Основание.Пустая() Тогда
			//Если ТипЗнч(ЗаказДоговор.Основание) = Тип("ДокументСсылка.Замер") Тогда
			//	Если НЕ ЗаказДоговор.Основание.Основание = Неопределено Тогда
			//		Если ТипЗнч(ЗаказДоговор.Основание.Основание) = ТипЗнч(Документы.ВходящийКонтакт.ПустаяСсылка()) Тогда
			//			МенеджерПродажи = ЗаказДоговор.Основание.Основание.Ответственный;
			//		КонецЕсли;
			//	КонецЕсли;			
			//Иначе
			Если ТипЗнч(ЗаказДоговор.Основание) = Тип("ДокументСсылка.Лид") Тогда
				МенеджерПродажи = ЗаказДоговор.Основание.Автор;
			КонецЕсли;
		КонецЕсли;	
		Движения.ПродажиПоЗаказДоговорам.Записывать = Истина;
		Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
			Движение = Движения.ПродажиПоЗаказДоговорам.Добавить();
			Движение.Период = ПериодЗД; //Дата; #14559
			Движение.Контрагент = ЗаказДоговор.Контрагент;
			Движение.Номенклатура = ТекущаяСтрока.Номенклатура;
			Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры; // №10772
			Движение.МенеджерКонтакта = МенеджерПродажи;
			Движение.ТочкаПродаж = ЗаказДоговор.ТочкаПродаж;
			Движение.ТехнологЗамера = ЗаказДоговор.ИсполнительЗамера;
			Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
			Движение.Сумма = РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(ЗаказДоговор, ТекущаяСтрока.Сумма);
		КонецЦикла;
		
	КонецЕсли;
	
	Движения.ТоварыНаСкладах.Записывать = Истина;
	
	// Списание материалов
	Если Материалы.Количество() > 0 И НЕ СкладСписанияМатериалов.Пустая() Тогда
		ТаблицаСписанияМатериалы = Материалы.Выгрузить();
		ТаблицаСписанияМатериалы.Очистить();
		Для Каждого ТекущаяСтрока Из Материалы Цикл
			Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
				НоваяСтрока = ТаблицаСписанияМатериалы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			КонецЕсли;
		КонецЦикла;
		
		//++ №8793 нужно свернуть, чтобы корректно списать себестоимость
		ТаблицаСписанияМатериалы.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент", "Количество"); 
		//-- №8793
		
		Если НЕ ТаблицаСписанияМатериалы.Количество() = 0 Тогда
			Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, Организация, СкладСписанияМатериалов, ТаблицаСписанияМатериалы, Дата);
			Если Отказ Тогда
				Возврат;
			Иначе
				Для Каждого Товар Из ТаблицаСписанияМатериалы Цикл
					Расход = Движения.ТоварыНаСкладах.Добавить();
					Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
					Расход.Период = Дата;
					Расход.Организация = Организация;
					Расход.Склад = СкладСписанияМатериалов;
					Расход.Номенклатура = Товар.Номенклатура;
					Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;						
					Расход.Количество = Товар.Количество * Товар.Коэффициент;
					//#8288
					//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(Дата, Организация, СкладСписанияМатериалов, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
					СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(Дата, Организация, СкладСписанияМатериалов, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
					Расход.Сумма = Расход.Количество * СтруктураЦенОстатков.Цена;
					Расход.СуммаВал = Расход.Количество * СтруктураЦенОстатков.ЦенаВал;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;
	
	// Списание товаров
	Если ТоварыУслуги.Количество() > 0 И НЕ СкладСписанияТоваров.Пустая() Тогда
		ТаблицаСписанияТовары = ТоварыУслуги.Выгрузить();
		ТаблицаСписанияТовары.Очистить();
		Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
			Если НЕ ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
				НоваяСтрока = ТаблицаСписанияТовары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);					
			КонецЕсли;
		КонецЦикла;
		
		//++ №8793 нужно свернуть, чтобы корректно списать себестоимость
		ТаблицаСписанияТовары.Свернуть("Номенклатура, ХарактеристикаНоменклатуры, ЕдиницаИзмерения, Коэффициент", "Количество"); 
		//-- №8793
		
		Если НЕ ТаблицаСписанияТовары.Количество() = 0 Тогда
			Отказ = НЕ Движения.ТоварыНаСкладах.КонтрольОстатков(Ссылка, Организация, СкладСписанияТоваров, ТаблицаСписанияТовары, Дата);
			Если Отказ Тогда
				Возврат;
			Иначе
				Для Каждого Товар Из ТаблицаСписанияТовары Цикл
					Расход = Движения.ТоварыНаСкладах.Добавить();
					Расход.ВидДвижения = ВидДвиженияНакопления.Расход;
					Расход.Период = Дата;
					Расход.Организация = Организация;
					Расход.Склад = СкладСписанияТоваров;
					Расход.Номенклатура = Товар.Номенклатура;
					Расход.ХарактеристикаНоменклатуры = Товар.ХарактеристикаНоменклатуры;						
					Расход.Количество = Товар.Количество * Товар.Коэффициент;
					//#8288
					//Расход.Сумма = Расход.Количество * Движения.ТоварыНаСкладах.ПолучитьЦенуОстаткаНоменклатуры(Дата, Организация, СкладСписанияТоваров, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);											
					СтруктураЦенОстатков = Движения.ТоварыНаСкладах.ПолучитьЦеныОстаткаНоменклатуры(Дата, Организация, СкладСписанияТоваров, Расход.Номенклатура, Расход.ХарактеристикаНоменклатуры, Расход.СерияНоменклатуры);
					Расход.Сумма = Расход.Количество * СтруктураЦенОстатков.Цена;
					Расход.СуммаВал = Расход.Количество * СтруктураЦенОстатков.ЦенаВал;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;		
	КонецЕсли;
	
	//продажи
	ВалютаУчета = Константы.ВалютаУчета.Получить();
	Движения.Продажи.Записывать = Истина;		
	Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
		Движение = Движения.Продажи.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Склад = СкладСписанияТоваров; //#12367
		Движение.ДоговорКонтрагента = ЗаказДоговор.ДоговорКонтрагента;
		Движение.ДокументПродажи = ЗаказДоговор; // №12975 было: Ссылка;
		Движение.Количество = ТекущаяСтрока.Количество * ТекущаяСтрока.Коэффициент;
		Движение.Контрагент = ЗаказДоговор.Контрагент;
		Движение.Номенклатура = ТекущаяСтрока.Номенклатура; 
		Движение.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатуры;
		Движение.ЕдиницаИзмерения = ТекущаяСтрока.ЕдиницаИзмерения;         //#14300
		Движение.КоличествоВЕдиницахДокумента = ТекущаяСтрока.Количество;	//#14300
		Движение.Сумма = РаботаСВалютой.ПересчитатьИзВалютыВВалюту(ЗаказДоговор.Валюта, ВалютаУчета, Дата, ТекущаяСтрока.Сумма);
		Движение.СуммаВал = РаботаСВалютой.ПолучитьСуммуВДопВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма, ЗаказДоговор.Валюта); //#8288
	КонецЦикла;
	
	// регистр ДоходыРасходы
	Если ПараметрыСеанса.ФинРезультатИспользоватьВедениеУчетаДоходовРасходов И ПараметрыСеанса.ФинРезультатНеКассовыйМетодВеденияУчетаДоходовРасходов Тогда
		//метод "по начислению"
		Метод = Перечисления.МетодыВеденияУчетаДоходовРасходов.Некассовый;
		Движения.ДоходыРасходы.Записывать = Истина;		
		Для Каждого ТекущаяСтрока Из ТоварыУслуги Цикл
			Статья = ?(НЕ ТекущаяСтрока.СтатьяДоходов.Пустая(), ТекущаяСтрока.СтатьяДоходов, СтатьяДоходов);
			Если Статья.Пустая() ИЛИ ТекущаяСтрока.Сумма = 0 Тогда
				Продолжить;
			КонецЕсли;
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= ЗаказДоговор.Подразделение;
			Движение.Статья 		= Статья;
			Движение.Метод		 	= Метод;
			Движение.СуммаДоходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, ТекущаяСтрока.Сумма);
			Движение.СуммаРасходов 	= 0;
		КонецЦикла;	
		
		Если НЕ СтатьяРасходов.Пустая() И СуммаДополнительныхЗатрат > 0 Тогда
			Движение = Движения.ДоходыРасходы.Добавить();
			Движение.Период 		= Дата;
			Движение.Организация 	= Организация;
			Движение.Подразделение 	= ЗаказДоговор.Подразделение;
			Движение.Статья 		= СтатьяРасходов;
			Движение.Метод		 	= Метод;
			Движение.СуммаДоходов 	= 0;
			Движение.СуммаРасходов 	= РаботаСВалютой.ПолучитьСуммуВВалютеУчетаПоДокументу(Ссылка, СуммаДополнительныхЗатрат);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//#13710
	ОбщийМодульСервер.ПроверитьИзменениеВзаиморасчетовПриЗаписи(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти

#Область Заполнение

Процедура ИнициализироватьСлужебныеРеквизиты()
	
	//#14828
	СозданПриИспользованииПодразделений  = Константы.ИспользоватьПодразделения.Получить();
	
КонецПроцедуры

Процедура ДозаполнитьПоУмолчанию()
	
КонецПроцедуры

Процедура ЗаполнитьТоварыПоДоговору() Экспорт
	
	ТоварыУслуги.Очистить();
	
	Для Каждого ТекущаяСтрока Из ЗаказДоговор.ТоварыУслуги Цикл
		
		//Если ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
		//	Продолжить;
		//КонецЕсли;
		
		НоваяСтрока = ТоварыУслуги.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьМатериалыПоДоговору() Экспорт
	
	Материалы.Очистить();
	
	Для Каждого ТекущаяСтрока Из ЗаказДоговор.Материалы Цикл
		
		//Если ТекущаяСтрока.Номенклатура.ВидНоменклатуры = Справочники.ВидыНоменклатуры.Услуга Тогда
		//	Продолжить;
		//КонецЕсли;
		
		НоваяСтрока = Материалы.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
